Revit 2027 API
VertexStreamPositionNormal.AddVertices Method
 Inserts multiple VertexStreamPositionNormal instances into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddVertices(
	IList<VertexPositionNormal> vertices
)
Public Sub AddVertices (
	vertices As IList(Of VertexPositionNormal)
)
public:
void AddVertices(
	IList<VertexPositionNormal^>^ vertices
)
member AddVertices :
        vertices : IList<VertexPositionNormal> -> unit
Parameters
vertices IList<VertexPositionNormal>
 The vertices to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
VertexStreamPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace